In [1]:
#Tower - 20 - Frank, Charles, 
#LA - 30
TowerList = ['Frank', 'Charles']
LAList = ['Betty', 'Eliza']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame({'TowerList':TowerList, 'LAList':LAList})

In [5]:
df

  TowerList LAList
0     Frank  Betty
1   Charles  Eliza

In [6]:
df = pd.DataFrame({'Names': TowerList+LAList, 'Theater':['Tower','Tower','LA','LA']})

In [7]:
df
df

     Names Theater
0    Frank   Tower
1  Charles   Tower
2    Betty      LA
3    Eliza      LA

In [8]:
NameSource = ['Frank','Frank']
NameTarget = ['Charles','Eliza']
TheaterSource = ['Tower','Tower']
TheaterTarget = ['Tower','LA']
NumTimes = [3,1]

In [9]:
df = pd.DataFrame({'NameSource':NameSource,
                   'NameTarget':NameTarget,
                   'Theater1':TheaterSource,
                   'Theater2':TheaterTarget,
                   'Occurrences':NumTimes})

In [10]:
df

  NameSource NameTarget Theater1 Theater2  Occurrences
0      Frank    Charles    Tower    Tower            3
1      Frank      Eliza    Tower       LA            1